IRP/src/Catalogs/PlanningPeriods/PlanningPeriods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>PlanningPeriods</name>
 <hierarchical>true</hierarchical>
 <attributes>
  <name>BeginDate</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>EndDate</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>IsFinancial</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>IsManufacturing</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>IsSalary</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>BusinessUnits</name>
  <attributes>
   <name>BusinessUnit</name>
   <type>
    <types>CatalogRef.BusinessUnits</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/PlanningPeriods/ManagerModule.bsl
Procedure ChoiceDataGetProcessing(ChoiceData, Parameters, StandardProcessing)
	If Parameters.Property("Filter") And Parameters.Filter.Property("BusinessUnit") Then
		
		StandardProcessing = False;
		Query = New Query();
		Query.Text = 
		"SELECT
		|	Table.Ref AS Ref
		|FROM
		|	Catalog.MF_PlanningPeriods.BusinessUnits AS TableBusinessUnits
		|		INNER JOIN Catalog.MF_PlanningPeriods AS Table
		|		ON Table.Ref = TableBusinessUnits.Ref
		|		AND NOT Table.DeletionMark
		|		AND TableBusinessUnits.BusinessUnit = &BusinessUnit
		|		AND Table.Description LIKE ""%"" + &SearchString + ""%""";
		Query.SetParameter("BusinessUnit" , Parameters.Filter.BusinessUnit);
		Query.SetParameter("SearchString" , Parameters.SearchString);
	
		QueryResult = Query.Execute();
		QuerySelection = QueryResult.Select();
		ChoiceData = New ValueList();
		While QuerySelection.Next() Do
			ChoiceData.Add(QuerySelection.Ref);
		EndDo;
		
	EndIf;
EndProcedure
